var  kol_zad_vbase10_1=25;    
var  kol_zad_vbase10_2=18;   // (ЕГЭ№17 без с.с)   всего 18
var  kol_zad_vbase10_3=47;
var  kol_zad_vbase10_4=34;  //  Списки из букв (ЕГЭ8,часть) тема сист счисления       всего 34 
var  kol_zad_vbase10_5=18;   // (ЕГЭ№17 без с.с)
var  kol_zad_vbase10_6=26;   //Комбинаторика (ЕГЭ8, часть)     всего 26 
var  kol_zad_vbase10_7=0;
var  kol_zad_vbase10_8=0;
var  kol_zad_vbase10_9=0;    
var  kol_zad_vbase10_10=0;
var  kol_zad_vbase10_11=0;    
var  kol_zad_vbase10_12=0;
var  kol_zad_vbase10_13=0;
var  kol_zad_vbase10_14=0;    
var  kol_zad_vbase10_15=0;
var  kol_zad_vbase10_16=0;    
var  kol_zad_vbase10_17=0;
var  kol_zad_vbase10_18=0;
var  kol_zad_vbase10_19=0;    
var  kol_zad_vbase10_20=0;


var test = "ЕГЭ";
var peremeshat_voprosi = "да";
var vopros_1 = "";
var vopros_2 = "";
var vopros_3 = "";
var vopros_4 = "";
var vopros_5 = "";
var vopros_6 = "";
var vopros_7 = "";
var vopros_8 = "";
var vopros_9 = "";
var vopros_10 = "";
var vopros_11 = "";
var vopros_12 = "";
var vopros_13 = "";
var vopros_14 = "";
var vopros_15 = "";
var vopros_16 = "";
var vopros_17 = "";
var vopros_18 = "";
var vopros_19 = "";
var vopros_20 = "";
var vopros_21 = "";
var vopros_22 = "";
var vopros_23 = "";
var vopros_24 = "";
var vopros_25 = "";
var vopros_26 = "";
var vopros_27 = "";
var vopros_28 = "";
var vopros_29 = "";
var vopros_30 = "";
var vopros_31 = "";
var vopros_32 = "";
var vopros_33 = "";
var vopros_34 = "";
var vopros_35 = "";
var vopros_36 = "";
var vopros_37 = "";
var vopros_38 = "";
var vopros_39 = "";
var vopros_40 = "";
var vopros_41 = "";
var vopros_42 = "";
var vopros_43 = "";
var vopros_44 = "";
var vopros_45 = "";
var vopros_46 = "";
var vopros_47 = "";
var vopros_48 = "";
var vopros_49 = "";
var vopros_50 = "";

//ЗАДАНИЕ №1
//старое первое задание на системы счисления
//1_2,1_3,1_13,1_14,1_15,1_22,1_23,1_24,1_25,1_27,
//1_40,1_43,1_45,1_47,1_48,1_55,1_73,1_74,1_77,1_79,
//1_84,1_85,1_86,1_91,1_94

//ЗАДАНИЕ №2
//задание №17 только с системами счисления
//17_27,17_28,17_29,17_30,17_31,
//17_32,17_33, 17_34,17_39,17_40,
//17_41,17_42,17_43,17_44,17_49.
//17_50, 17_51,17_52
							

// старое 16_1,16_2,16_3,16_4,16_6
//16_8,16_9,16_10,16_12,16_13
//16_14,16_15,16_16,16_18,16_19
//16_21,16_22,16_24,16_25,16_26
//16_29,16_30,16_31,16_32,16_34
//16_35,16_36,16_40,16_41,16_42,
//16_43,16_44,16_52,16_55,16_56
//16_57,16_58,16_59,16_60,16_61
//16_62,16_73,16_74,16_75,16_76
//16_77,16_78
							
//Задание №4  - Списки из букв (ЕГЭ8,часть) тема сист счисления
//182,179,178,155,127,126,87,86,85,84,
//83,82,81,80,79,78,74,73,72,71,
//38,37,36,35,20,19,18,17,16,15,
//14,11,8,7,							

// Задание №5  (ЕГЭ№17 без с.с)
//17_1,17_2, 17_3, 17_4, 17_5, 17_6, 17_7, 17_23, 17_24, 17_25,
//17_26, 17_35, 17_36,17_37,17_38,17_45,17_47, 17_48


//Задание №6 Комбинаторика
//176,174,173,172,171,170,165,164,163,160
//159,147,142,141,140,133,128,125,123,113
//112,111,110,109,103,100





var identificatori  = [['22','Иванов10'],       ['07691281','Брюхов10'], ['07604704','Ваганов10'],['0765825','Голомако10'], ['0760816','Емелин10'],
                       ['0766339','Калякин10'], ['0764957','Курицын10'], ['0761851','Лыжин10'],   ['0765331','Тарасенко10'],['07619845','Шустров10'],
					   ['0765094','Буров10'],   ['0764965','Ершов10'],   ['0760925','Коротина10'],['0764295','Лебедев10'],  ['0767207','Матухина10'],
					   ['0768853','Москалев10'],['075389','Суслов10'],   ['0763965','Черякин10'], ['0763891','Шишкова10'],  ['0764378', 'Толстикова10']];					  
					  
					  
					  
					  
					  
					  
					  
					  